Repository: lazaroah02/Church-Calendar
Catalog: backend/app/locale/*/LC_MESSAGES/django.po
Languages: es

source: A user with this email already exists.
es: Ya existe un usuario con este correo electrónico.

source: A user with this username already exists.
es: Ya existe un usuario con este nombre de usuario.

source: You must be at least 10 years old to use the app.
es: Debes tener al menos 10 años para usar la aplicación.

source: This color is being used by other group.
es: Este color está siendo usado por otro grupo. Por favor usa otro.

source: White color is not allowed. Please choose another color.
es: El color blanco no puede ser usado. Por favor utiliza otro.

source: Invalid color format. Please provide a valid hex color code.
es: Formato de color inválido. Por favor utiliza otro.

source: You cannot remove users from the general group.
es: No puedes eliminar usuarios del grupo general.

source: Error on the request. Verify the group exists.
es: Error en la operación. Verifica que el grupo exista.

source: Invalid timezone
es: Zona Horaria no válida

source: start_date and end_date are required when group_by is specified.
es: Se requieren start_date y end_date cuando se especifica group_by.

source: start_date must be earlier than end_date.
es: start_date debe ser anterior a end_date.

source: The date range cannot exceed 31 days.
es: El rango de fechas no puede exceder los 31 días.

source: Authentication required to make reservations.
es: Se requiere autenticación para hacer reservas.

source: You have reserved for this event.
es: Ya tienes una reserva para este evento.

source: You don't have reservations for this event.
es: No tienes reservas para este evento.

source: Event requested doesn't exist.
es: El evento solicitado no existe.

source: This event is not open to reservations.
es: Este evento no está abierto a reservas.

source: This event has reached its reservation limit.
es: Este evento ha alcanzado su límite de reservas.

source: You have already made a reservation for this event.
es: Ya has hecho una reserva para este evento.

source: Reservation created successfully.
es: Reserva creada exitosamente.

source: Reservation deleted successfully.
es: Reserva eliminada correctamente.

source: Notification Token is required.
es: Se requiere el Token de notificación.

source: Timezone is required.
es: Se requiere la zona horaria.

source: Notification Token and timezone saved successfully.
es: Token de notificación y zona horaria guardados correctamente.

source: Event ID is required.
es: Se requiere el ID del evento.

source: Event not found.
es: Evento no encontrado.

source: Failed to send notification. Try again later
es: Error al enviar la notificación. Intenta de nuevo más tarde.

source: The 'minutes' field must be a valid integer.
es: El campo 'minutes' debe ser un número entero válido.

source: Checked for upcoming events and sent notifications successfully.
es: Se verificaron los próximos eventos y se enviaron las notificaciones correctamente.

source: Failed to check for upcoming events. Try again later.
es: Error al verificar los próximos eventos. Intenta de nuevo más tarde.

source: Notification sent to everyone.
es: Notificación enviada a todos.

source: Failed sending notification. Try again later.
es: Error al enviar la notificación. Intenta de nuevo más tarde.

source: Designates whether the user can log in
es: Indica si el usuario puede iniciar sesión

source: Designates whether the user can access the admin panel
es: Indica si el usuario puede acceder al panel de administración

source: An admin/superuser user must be staff too
es: Un usuario administrador o superusuario también debe ser parte del personal

source: You can't delete yourself while you're logged in
es: No puedes borrar tu propio usuario mientras estas logeado.

source: Missing '{field}' in query body
es: Debes seleccionar al menos un '{field}'.

source: Invalid {log_name} IDs.
es: IDs de {log_name} inválido.

source: No {log_name} were deleted. Check if the IDs are correct.
es: Ningún {log_name} fue borrado. Verifica que sus IDs sean correctos.

source: Password was not provided
es: No se proporcionó una contraseña.
